<template>
	<div v-if="selectedRiverFacts.length > 0">
		<h3>{{ selectedRiverFacts[selectedIndex].factTitle }}</h3>
		<p>{{ selectedRiverFacts[selectedIndex].fact }}</p>
		<button @click="previousFact">Назад</button>
		<button @click="nextFact">Вперед</button>
	</div>
</template>

<script setup lang="ts">
import { ref } from 'vue'

const selectedRiverFacts = ref([
	{
		factTitle: 'Интересный факт о реке Дон',
		fact: 'Река Дон, одна из крупнейших в России, не уникальна в плане названия. Реки с таким названием есть в Англии, Шотландии, Лаосе, Канаде, Франции и Австралии.'
	},
	{
		factTitle: 'Интересный факт о Волге',
		fact: 'У Волги есть собственный праздник, который отмечается ежегодно 20 мая.'
	},
	{
		factTitle: 'Интересный факт об Енисее',
		fact: 'Самая глубокая река в России – Енисей, протекающий по Сибири и впадающий в Карское море. Его максимальная глубина достигает 70 метров'
	},
	{
		factTitle: 'Интересный факт о Ниле',
		fact: 'Самая древняя река в мире - это протекающий в Африке Нил'
	},
	{
		factTitle: 'Интересный факт о реках Финляндии',
		fact: 'Страна с наибольшим количеством рек — Финляндия. По её территории протекает 650 рек.'
	},
	{
		factTitle: 'Интересный факт о Ниле',
		fact: 'Самой длинной рекой считается Нил. Ее длина составляет примерно 6853 км.'
	},
	{
		factTitle: 'Интересный факт о реках Саудовской Аравии',
		fact: 'Есть страна, на территории которой нет ни одной реки. Это Саудовская Аравия.'
	},
	{
		factTitle: 'Интересный факт о реке Урал',
		fact: 'Естественной водной границей между Азией и Европой считается река Урал.'
	},
	{
		factTitle: 'Интересный факт о российских реках',
		fact: 'Суммарная протяжённость российских рек превышает 12,4 млн км. Это в 32 с лишним раза больше расстояния от Земли до Луны.'
	},
	{
		factTitle: 'Интересный факт о самой маленькой реке',
		fact: 'Длина самой маленькой реки составляет всего лишь 18 метров.'
	},
	{
		factTitle: 'Интересный факт об Амазонке',
		fact: 'Амазонку в 2011 году признали одним из чудес света.'
	},
	{
		factTitle: 'Интересный факт о реке с самым смешным названием',
		fact: 'Самое веселое название имеет река Куку-река.'
	},
	{
		factTitle: 'Интересный факт о Ниле',
		fact: 'В 9 и 11 веках река Нил дважды покрывалась льдом.'
	},
	{
		factTitle: 'Интересный факт о реке Инд',
		fact: 'Название Индии произошло именно от названия реки Инд, потому что долины, где протекает данная река, стали жильем первых поселенцев государства.'
	},
	{
		factTitle: 'Интересный факт о реке Рейн',
		fact: 'Фотография с изображение реки Рейн считается самой дорогой в мире. За 4 миллиона она была продана на аукционе.'
	},
	{
		factTitle: 'Интересный факт о приговоре реке',
		fact: 'Случалось, когда реку приговорили к смертной казни. Когда царь Кир, перенаправляясь через реку, потерял жизнь своего коня, он приказал убрать реку.'
	}
])

const selectedIndex = ref(0)

const previousFact = () => {
	if (selectedIndex.value >= 0) {
		selectedIndex.value -= 1
	}
	if (selectedIndex.value < 0) {
		selectedIndex.value = selectedRiverFacts.value.length - 1
	}
}

const nextFact = () => {
	if (selectedIndex.value <= selectedRiverFacts.value.length - 1) {
		selectedIndex.value += 1
	}
	if (selectedIndex.value > selectedRiverFacts.value.length - 1) {
		selectedIndex.value = 0
	}
}
</script>

<style scoped></style>
